#+BLOG: rubikitch
#+POSTID: 2451
#+DATE: [2016-07-07 Thu 10:48]
#+PERMALINK: readable-small-packages
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil \n:t -:nil
#+ISPAGE: nil
#+DESCRIPTION:
# (progn (erase-buffer)(find-file-hook--org2blog/wp-mode))
#+BLOG: rubikitch
#+CATEGORY: Emacs, Emacs Lisp, org-mode
#+DESCRIPTION: 
#+MYTAGS: emacs lisp ソースコードを読む, elisp 読むべきソースコード, emacs lisp コードリーディング, どのソースコードを読むべき？, 短いelispパッケージ, emacs lispを学ぶ
#+TITLE: Emacs Lisp学習者向け！ソースコード短さランキング
#+begin: org2blog-tags
#+TAGS: emacs lisp ソースコードを読む, elisp 読むべきソースコード, emacs lisp コードリーディング, どのソースコードを読むべき？, 短いelispパッケージ, emacs lispを学ぶ, Emacs, Emacs Lisp, org-mode, 
#+end:
Emacsを深く使うにあたってはEmacs Lispを学ぶことは避けられません。
Lispレベルまで理解していれば、様々な問題に対して自分で解決できますし、自分が欲しい機能を自分で実装できたりするからです。

elispを深く学ぶには、infoマニュアルや拙著[[http://gihyo.jp/book/2011/978-4-7741-4897-7][Emacs Lispテクニックバイブル　〜真髄を知るLispの掟〜]] を通読するのもいいですが、やはり実際のソースコードを読んで実行して理解するのが早道です。
では、どのようなコードを読めばいいのかというと、全体像を理解できるくらいの短いコードを読めばいいです。

そこで、僕の手持ちのパッケージからソースコードの短い順でランキング付けしました。
僕は[[http://rubikitch.com/2014/09/01/quelpa/][quelpa]] でパッケージを管理していますが、el-getの方は以下のスクリプトで ~/.emacs.d/quelpa/build → ~/.emacs.d/el-get の置換をすれば動きます。

ここでいう「行数」とはソースコードの実行数であり、行単位のコメント(先頭行が;)と空行を除いたものです。
行数が一桁のものはrequireとprovideでオシマイなので、10行以上のものを選択しましょう。
50行以内のパッケージもそれなりに多いので学習の助けになるでしょう。

sudo-edit.elは6行のコマンドが2つだけというごく小さなパッケージなので理解はたやすいです。
逆に、こんな短いものであってもヘッダを書いて[[http://syohex.hatenablog.com/entry/20121021/1350823391][所定の手続きを踏めば]] MELPAに登録されるので、便利で安定している自作コマンドがあるならば思い切ってMELPA登録申請してみましょう。
MELPAへのパッケージ登録はelisp初心者でもできるのです。

なお、この記事はorg-babelの実行機能を使っています。

** 結果

#+BEGIN_SRC ruby 
def code_lines(el)
  File.read(el).force_encoding("binary").lines.grep(/^[^;]./).length
end

Dir.chdir File.expand_path("~/.emacs.d/quelpa/build/")
pkgs = Dir["*"]
els = pkgs.map{|d| "#{Dir.pwd}/#{d}/#{d}.el"}.select{|el| File.exist?(el)}
[["行数", "バイト数", "パッケージ名"], nil].concat(
  els.map{|el| [code_lines(el), File.size(el), File.basename(el,".el")]}.sort)
#+END_SRC

#+RESULTS:
|  行数 | バイト数 | パッケージ名                    |
|-------+----------+---------------------------------|
|     1 |      308 | python3-info                    |
|     2 |       48 | solarized-theme                 |
|     2 |       56 | apropospriate-theme             |
|     2 |     2692 | google-translate                |
|     3 |      408 | boon                            |
|     4 |      255 | noctilux-theme                  |
|     5 |     1053 | gh                              |
|     8 |     8203 | multiple-cursors                |
|    13 |     1870 | sudo-edit                       |
|    13 |     1928 | dedicated                       |
|    14 |     2151 | wgrep-ag                        |
|    15 |     1902 | helm-filesets                   |
|    16 |     2045 | dired-imenu                     |
|    17 |     1292 | cd-compile                      |
|    17 |     2133 | date-at-point                   |
|    19 |     2207 | gitignore-mode                  |
|    20 |     2073 | hookify                         |
|    22 |     1371 | ob-browser                      |
|    24 |     2359 | howm                            |
|    25 |     2236 | esh-buf-stack                   |
|    25 |     2675 | dired-sort                      |
|    25 |     2909 | ido-occasional                  |
|    25 |     3290 | switch-buffer-functions         |
|    26 |     3424 | roguel-ike                      |
|    28 |     1702 | subshell-proc                   |
|    28 |     2766 | realtime-preview                |
|    29 |     2234 | request-deferred                |
|    29 |     2651 | ruby-hash-syntax                |
|    29 |     2754 | pmdm                            |
|    31 |     1750 | oniisama                        |
|    31 |     1757 | color-theme-solarized           |
|    33 |     3327 | omni-scratch                    |
|    33 |     3339 | ibuffer-tramp                   |
|    34 |     2592 | cbm                             |
|    34 |     3047 | easy-repeat                     |
|    35 |     2266 | css-eldoc                       |
|    35 |     2280 | pastelmac-theme                 |
|    35 |     3016 | better-defaults                 |
|    39 |     4850 | recentf-ext                     |
|    40 |     3664 | morlock                         |
|    41 |     3042 | idomenu                         |
|    41 |     3742 | phi-search-migemo               |
|    42 |     2454 | sudden-death                    |
|    42 |     3386 | man-commands                    |
|    42 |     3596 | unify-opening                   |
|    42 |     4930 | echo-bell                       |
|    43 |     2950 | verify-url                      |
|    43 |     3174 | ido-describe-bindings           |
|    43 |     3239 | twilight-theme                  |
|    43 |     3822 | prompt-text                     |
|    44 |     2771 | helm-hoogle                     |
|    44 |     3069 | fic-mode                        |
|    46 |     5100 | backup-each-save                |
|    46 |     6050 | open-junk-file                  |
|    47 |     3155 | define-word                     |
|    47 |     3284 | zzz-to-char                     |
|    48 |     3172 | scratch-pop                     |
|    48 |     3191 | bitly                           |
|    49 |     3228 | drill-instructor-AZIK-force     |
|    49 |     4186 | unkillable-scratch              |
|    49 |     7183 | term-alert                      |
|    50 |     2316 | backtrace-mode                  |
|    50 |     3322 | arjen-grey-theme                |
|    50 |     4431 | ace-jump-helm-line              |
|    51 |     3133 | logito                          |
|    51 |     3327 | termbright-theme                |
|    51 |     3402 | headlong                        |
|    52 |     3491 | real-auto-save                  |
|    52 |     7179 | wimpy-del                       |
|    52 |     8330 | expand-region                   |
|    53 |     4139 | dim-autoload                    |
|    53 |     4360 | path-headerline-mode            |
|    54 |     3317 | phi-search-dired                |
|    54 |     3446 | guru-mode                       |
|    54 |     3983 | paredit-menu                    |
|    54 |     4517 | outlined-elisp-mode             |
|    54 |     4937 | smart-cursor-color              |
|    55 |     2549 | ob-translate                    |
|    55 |     4496 | codesearch                      |
|    55 |     4980 | yatemplate                      |
|    56 |     3665 | hl-todo                         |
|    57 |     2278 | sane-term                       |
|    57 |     6265 | sticky                          |
|    58 |     3423 | tab-jump-out                    |
|    59 |     4147 | init-open-recentf               |
|    59 |     4527 | helm-mode-manager               |
|    59 |     4690 | linum-relative                  |
|    59 |     8975 | dired-details+                  |
|    60 |     3985 | bury-successful-compilation     |
|    60 |     4024 | darkmine-theme                  |
|    60 |     4376 | seeing-is-believing             |
|    60 |     4703 | easy-escape                     |
|    60 |     5909 | filesets+                       |
|    60 |     6507 | sequential-command              |
|    61 |     3679 | helm-package                    |
|    61 |     3682 | atom-one-dark-theme             |
|    61 |     4265 | dired-avfs                      |
|    62 |     4693 | elscreen-persist                |
|    62 |     4957 | avy-zap                         |
|    63 |     4404 | repeatable-motion               |
|    63 |     4718 | flycheck-color-mode-line        |
|    63 |     7387 | term-cmd                        |
|    64 |     4083 | scratch-palette                 |
|    64 |     6996 | helm-migemo                     |
|    65 |     3382 | abyss-theme                     |
|    65 |     3520 | org-doing                       |
|    65 |     5264 | railscasts-theme                |
|    66 |     3331 | dired-toggle-sudo               |
|    66 |     5282 | map-regexp                      |
|    66 |     5585 | page-break-lines                |
|    66 |     6866 | waher-theme                     |
|    67 |     4195 | helm-chrome                     |
|    67 |     4802 | ctags                           |
|    67 |     5196 | sync-recentf                    |
|    67 |     5784 | green-phosphor-theme            |
|    67 |     5790 | autumn-light-theme              |
|    67 |     5867 | goto-last-change                |
|    69 |     5094 | hemisu-theme                    |
|    70 |     4172 | relative-buffers                |
|    70 |     4420 | ido-springboard                 |
|    70 |     4780 | 0blayout                        |
|    71 |     4649 | helm-firefox                    |
|    71 |     4859 | watch-buffer                    |
|    71 |     6871 | hide-lines                      |
|    72 |     4585 | busybee-theme                   |
|    72 |     5249 | chinese-word-at-point           |
|    73 |     4179 | eshell-did-you-mean             |
|    73 |     4733 | system-specific-settings        |
|    74 |     3430 | ace-jump-zap                    |
|    75 |     4218 | esh-help                        |
|    75 |     4447 | narrow-reindent                 |
|    75 |     5548 | myterminal-controls             |
|    76 |     4222 | replace-symbol                  |
|    76 |     4310 | passthword                      |
|    76 |     4484 | ido-occur                       |
|    76 |     4619 | ido-at-point                    |
|    76 |     4955 | isearch-dabbrev                 |
|    76 |     5137 | term-run                        |
|    77 |     5101 | buffer-flip                     |
|    77 |     5843 | per-buffer-theme                |
|    77 |     6062 | md-readme                       |
|    77 |     6992 | colonoscopy-theme               |
|    78 |     5112 | shelltest-mode                  |
|    78 |     6214 | django-theme                    |
|    78 |     7886 | ubuntu-theme                    |
|    79 |     5560 | rand-theme                      |
|    80 |     3775 | expand-line                     |
|    80 |     4402 | helm-wordnet                    |
|    80 |     5775 | sunny-day-theme                 |
|    80 |     6431 | save-visited-files              |
|    80 |     7085 | boron-theme                     |
|    80 |     7193 | bliss-theme                     |
|    80 |     7241 | dark-krystal-theme              |
|    82 |     5583 | restart-emacs                   |
|    82 |     7289 | firecode-theme                  |
|    83 |     4997 | pandoc                          |
|    83 |     4998 | package-utils                   |
|    84 |     4619 | org-bullets                     |
|    84 |     5301 | shut-up                         |
|    84 |     6264 | highlight-leading-spaces        |
|    84 |     8141 | nav-flash                       |
|    85 |     7425 | peacock-theme                   |
|    85 |     7434 | lavender-theme                  |
|    85 |     7502 | flatland-black-theme            |
|    86 |     5463 | cycle-themes                    |
|    86 |     5662 | professional-theme              |
|    87 |     5001 | gitconfig-mode                  |
|    88 |     4548 | espresso-theme                  |
|    88 |     5277 | highlight-thing                 |
|    88 |     5312 | vc-auto-commit                  |
|    88 |     5365 | ietf-docs                       |
|    88 |     5971 | smart-newline                   |
|    88 |     6598 | auto-complete-pcmp              |
|    89 |     4795 | scratch-log                     |
|    89 |     5154 | gitty                           |
|    90 |     4247 | eshell-autojump                 |
|    90 |     6344 | ir-black-theme                  |
|    91 |     5978 | cl-lib-highlight                |
|    92 |     4577 | ac-mozc                         |
|    92 |     4853 | iterator                        |
|    92 |     5150 | centimacro                      |
|    92 |     5299 | discover-my-major               |
|    92 |     5385 | openwith                        |
|    92 |     8787 | org-password-manager            |
|    94 |     5939 | github-browse-file              |
|    94 |     6239 | xah-replace-pairs               |
|    94 |     6787 | soft-morning-theme              |
|    94 |    12366 | hl-line+                        |
|    95 |     6889 | seoul256-theme                  |
|    96 |     4924 | simple-call-tree                |
|    96 |     5372 | beginend                        |
|    97 |     5264 | mwim                            |
|    97 |     6901 | paper-theme                     |
|    98 |     5058 | markdown-mode+                  |
|    98 |     5238 | shrink-whitespace               |
|    98 |    12097 | clues-theme                     |
|    99 |     6009 | shell-split-string              |
|    99 |     6369 | badwolf-theme                   |
|    99 |     6817 | dired-narrow                    |
|   100 |     6349 | elscreen-multi-term             |
|   102 |     5489 | cyphejor                        |
|   102 |     6136 | cursor-test                     |
|   102 |    14699 | diminish                        |
|   103 |     7486 | pretty-symbols                  |
|   103 |     8174 | bubbleberry-theme               |
|   104 |     4300 | rotate                          |
|   104 |     5489 | golden-ratio                    |
|   104 |     6094 | describe-number                 |
|   105 |     6194 | helm-flx                        |
|   105 |     6548 | fm                              |
|   106 |     7020 | multi-compile                   |
|   107 |    13577 | faff-theme                      |
|   107 |    28083 | ace-pinyin                      |
|   109 |     6801 | delim-kill                      |
|   109 |     6822 | orglink                         |
|   109 |     7210 | eclipse-theme                   |
|   109 |    10150 | pp+                             |
|   109 |    11364 | hide-comnt                      |
|   110 |     6136 | smarty-mode                     |
|   111 |     6282 | inflections                     |
|   111 |     7216 | column-enforce-mode             |
|   112 |     5925 | google                          |
|   112 |     9777 | atom-dark-theme                 |
|   113 |     7773 | ibuffer-vc                      |
|   114 |     5698 | smartchr                        |
|   114 |     6874 | highlight-defined               |
|   115 |     6590 | smart-tab                       |
|   115 |     8794 | exec-path-from-shell            |
|   116 |     6410 | find-temp-file                  |
|   116 |    14321 | narrow-indirect                 |
|   117 |     6094 | helm-company                    |
|   117 |     6567 | diffview                        |
|   117 |     8119 | inkpot-theme                    |
|   117 |     8285 | idea-darkula-theme              |
|   118 |     7186 | springboard                     |
|   119 |     6815 | sublimity                       |
|   120 |     7698 | molokai-theme                   |
|   121 |     6368 | helm-bm                         |
|   121 |     8196 | dired-toggle                    |
|   122 |     5991 | spaces                          |
|   122 |     7715 | gandalf-theme                   |
|   124 |     5890 | noflet                          |
|   124 |     5979 | letcheck                        |
|   124 |     6556 | smartrep                        |
|   124 |     6756 | chruby                          |
|   124 |     6970 | projector                       |
|   124 |     8965 | borland-blue-theme              |
|   125 |     6660 | lice                            |
|   125 |     6711 | string-inflection               |
|   125 |     7093 | ace-popup-menu                  |
|   125 |    29592 | tinysegmenter                   |
|   126 |     5066 | ansi                            |
|   126 |     9969 | iodine-theme                    |
|   127 |     7311 | helm-flycheck                   |
|   127 |     8358 | caroline-theme                  |
|   128 |     6450 | multifiles                      |
|   128 |    11329 | pp-c-l                          |
|   130 |     8078 | cherry-blossom-theme            |
|   131 |     7746 | comment-dwim-2                  |
|   131 |     9801 | load-relative                   |
|   132 |     7118 | org-toc                         |
|   132 |     7330 | ido-clever-match                |
|   132 |     8272 | hideshowvis                     |
|   132 |     8429 | dired-open                      |
|   132 |     9783 | phi-search-mc                   |
|   132 |    10131 | darcula-theme                   |
|   132 |    12300 | pangu-spacing                   |
|   134 |     6352 | ace-jump-buffer                 |
|   134 |     6941 | dired-hacks-utils               |
|   134 |     7836 | paren-completer                 |
|   134 |     8025 | xah-lookup                      |
|   134 |     8346 | show-marks                      |
|   135 |     5628 | firebelly-theme                 |
|   135 |     7359 | pallet                          |
|   135 |     9045 | find-file-in-repository         |
|   137 |     7919 | olivetti                        |
|   137 |     8001 | ace-isearch                     |
|   138 |     8349 | hiwin                           |
|   138 |    11030 | hl-defined                      |
|   139 |     5944 | slack                           |
|   139 |     8102 | checkbox                        |
|   139 |     8575 | dired-single                    |
|   139 |    15400 | key-chord                       |
|   140 |     6056 | org-wc                          |
|   140 |     7734 | jaword                          |
|   140 |     7791 | org-eldoc                       |
|   141 |     5254 | jaunte                          |
|   141 |     7753 | free-keys                       |
|   141 |     9366 | orgit                           |
|   143 |     7943 | dash-functional                 |
|   143 |    16802 | keydef                          |
|   144 |     6364 | git-lens                        |
|   145 |     7199 | uimage                          |
|   145 |     7850 | omni-kill                       |
|   145 |     7931 | furl                            |
|   146 |     8076 | pcache                          |
|   146 |     8684 | http                            |
|   146 |    11124 | calmer-forest-theme             |
|   147 |     9361 | birds-of-paradise-plus-theme    |
|   148 |     6251 | edit-at-point                   |
|   149 |     8509 | dizzee                          |
|   149 |     9703 | auto-shell-command              |
|   150 |     6867 | ob-http                         |
|   150 |     8384 | hungry-delete                   |
|   150 |    11027 | ahungry-theme                   |
|   151 |     8387 | visible-mark                    |
|   151 |     8817 | download-region                 |
|   152 |     7644 | stash                           |
|   152 |     7982 | autobookmarks                   |
|   152 |     9921 | phi-search                      |
|   152 |    12020 | auto-save-buffers-enhanced      |
|   153 |     7971 | org-present                     |
|   153 |     8465 | highlight-stages                |
|   153 |     8543 | ac-skk                          |
|   154 |    10667 | ujelly-theme                    |
|   154 |    10686 | debug-print                     |
|   156 |     7215 | @                               |
|   156 |     8802 | gntp                            |
|   156 |    10503 | rich-minority                   |
|   156 |    11905 | iflipb                          |
|   157 |     7284 | mbe                             |
|   158 |     7653 | smart-compile                   |
|   158 |     9015 | nyan-mode                       |
|   158 |     9533 | eldoc-eval                      |
|   158 |    10330 | light-soap-theme                |
|   160 |     8702 | tabula-rasa                     |
|   161 |     9843 | psession                        |
|   161 |    10186 | dired-details                   |
|   162 |     8677 | punctuality-logger              |
|   162 |    12107 | distinguished-theme             |
|   163 |     8722 | firestarter                     |
|   164 |     7122 | number                          |
|   164 |     8315 | imenu-list                      |
|   164 |    12749 | planet-theme                    |
|   166 |     8124 | smeargle                        |
|   166 |     8506 | yandex-weather                  |
|   167 |     8289 | git-link                        |
|   168 |     8264 | autotetris-mode                 |
|   169 |     7916 | anyins                          |
|   169 |     9331 | helm-commandlinefu              |
|   169 |     9483 | window-numbering                |
|   169 |    10001 | imenu-anywhere                  |
|   169 |    10290 | dakrone-theme                   |
|   170 |     9420 | ido-migemo                      |
|   170 |     9685 | helm-descbinds                  |
|   170 |     9989 | windata                         |
|   170 |    10042 | kill-or-bury-alive              |
|   171 |    11835 | ctags-update                    |
|   172 |     9099 | rake                            |
|   172 |    15859 | cursor-chg                      |
|   173 |     8051 | itail                           |
|   173 |     9078 | sclang-extensions               |
|   175 |     8803 | jazzradio                       |
|   177 |     8077 | yafolding                       |
|   179 |     7560 | ruby-block                      |
|   179 |     9343 | fold-this                       |
|   180 |    13705 | findr                           |
|   181 |     8422 | swap-buffers                    |
|   181 |     9276 | elmacro                         |
|   182 |     8694 | helm-google                     |
|   182 |    10408 | loccur                          |
|   182 |    10562 | ido-completing-read+            |
|   183 |     7723 | general-close                   |
|   183 |     9071 | org-multiple-keymap             |
|   184 |     9106 | switch-window                   |
|   184 |    11356 | elscreen-separate-buffer-list   |
|   185 |     9301 | clocker                         |
|   185 |     9703 | focus                           |
|   185 |    10413 | pc-bufsw                        |
|   185 |    12591 | rainbow-delimiters              |
|   186 |     9072 | splitjoin                       |
|   187 |     7861 | string-edit                     |
|   188 |     7953 | git                             |
|   191 |    11632 | badger-theme                    |
|   191 |    12829 | broadcast                       |
|   191 |    14691 | toc-org                         |
|   192 |     9415 | cdb                             |
|   192 |    11151 | package-safe-delete             |
|   193 |    10638 | eshell-prompt-extras            |
|   194 |     9826 | smart-shift                     |
|   195 |    11588 | org-drill-table                 |
|   196 |    11242 | relative-line-numbers           |
|   196 |    11323 | highlight-blocks                |
|   197 |     9991 | flx-ido                         |
|   197 |    12325 | organic-green-theme             |
|   198 |    11664 | emoji-cheat-sheet-plus          |
|   198 |    12543 | el2markdown                     |
|   199 |    18044 | req-package                     |
|   200 |     8748 | undohist                        |
|   201 |     9847 | zlc                             |
|   202 |     8501 | ht                              |
|   202 |     9778 | zop-to-char                     |
|   203 |     8846 | bpr                             |
|   204 |    11451 | indent-guide                    |
|   204 |    13760 | persistent-soft                 |
|   205 |    10781 | flex-isearch                    |
|   205 |    12088 | pkg-info                        |
|   206 |    11716 | auto-yasnippet                  |
|   206 |    12279 | bind-key                        |
|   207 |     9590 | uzumaki                         |
|   207 |    13932 | melpa-upstream-visit            |
|   208 |    11926 | writeroom-mode                  |
|   208 |    13516 | goto-chg                        |
|   209 |    18324 | gruvbox-theme                   |
|   210 |    14172 | warm-night-theme                |
|   211 |    14713 | white-sand-theme                |
|   212 |    10157 | drag-stuff                      |
|   212 |    12039 | rainbow-identifiers             |
|   213 |     8837 | thingopt                        |
|   214 |    14463 | oldlace-theme                   |
|   214 |    14781 | showkey                         |
|   215 |    14398 | hamburg-theme                   |
|   215 |    15077 | reykjavik-theme                 |
|   216 |    15165 | greymatters-theme               |
|   218 |    14881 | phoenix-dark-pink-theme         |
|   225 |    22404 | embrace                         |
|   229 |     9240 | vim-region                      |
|   229 |    12616 | jump-char                       |
|   229 |    14055 | cloc                            |
|   229 |    16199 | el-autoyas                      |
|   231 |    13422 | c-eldoc                         |
|   231 |    13966 | auto-capitalize                 |
|   233 |    10816 | pcsv                            |
|   233 |    13448 | anything-replace-string         |
|   233 |    14998 | owdriver                        |
|   234 |    11806 | ample-regexps                   |
|   234 |    12817 | nodejs-repl                     |
|   235 |    12565 | jump                            |
|   236 |    10455 | mpv                             |
|   237 |    11353 | async                           |
|   237 |    11590 | shell-pop                       |
|   237 |    13348 | ido-vertical-mode               |
|   238 |    11078 | quickref                        |
|   238 |    11141 | dired-k                         |
|   238 |    13776 | magit-gh-pulls                  |
|   241 |    12673 | wrap-region                     |
|   241 |    23411 | clipmon                         |
|   242 |    12040 | yascroll                        |
|   242 |    12445 | camcorder                       |
|   244 |    17051 | rope-read-mode                  |
|   245 |    12037 | rect+                           |
|   246 |    13794 | corral                          |
|   247 |    13695 | test-simple                     |
|   254 |    15937 | niflheim-theme                  |
|   256 |    13844 | shell-switcher                  |
|   258 |    11400 | vline                           |
|   259 |    13411 | helm-ag-r                       |
|   259 |    16709 | simpleclip                      |
|   260 |    12651 | flx-isearch                     |
|   262 |    13078 | ert-runner                      |
|   262 |    13246 | flx                             |
|   265 |    14152 | ob-ipython                      |
|   265 |    14417 | edit-indirect                   |
|   266 |    13166 | imenus                          |
|   270 |    11797 | stripe-buffer                   |
|   271 |    16853 | gruber-darker-theme             |
|   272 |    14394 | shackle                         |
|   275 |    13572 | vlf                             |
|   276 |    14168 | save-sexp                       |
|   279 |    11717 | electric-spacing                |
|   279 |    17189 | centered-cursor-mode            |
|   280 |    14865 | aggressive-indent               |
|   281 |    10673 | quick-buffer-switch             |
|   282 |    15653 | kurecolor                       |
|   285 |    13903 | haskell-emacs                   |
|   287 |    14668 | eshell-z                        |
|   288 |    13525 | helm-perldoc                    |
|   288 |    15148 | helm-dash                       |
|   288 |    15187 | yaml-mode                       |
|   288 |    15882 | initsplit                       |
|   288 |    17648 | buffer-stack                    |
|   289 |    13364 | speed-type                      |
|   290 |    15866 | helm-open-github                |
|   292 |    13244 | garoon                          |
|   292 |    16016 | magit-gitflow                   |
|   292 |    19394 | helm-c-yasnippet                |
|   297 |    13089 | git-rebase-mode                 |
|   297 |    19099 | zerodark-theme                  |
|   299 |    14456 | tabulated-list                  |
|   301 |    12353 | ace-link                        |
|   302 |    21700 | airline-themes                  |
|   303 |    15732 | operate-on-number               |
|   306 |    17912 | howdoi                          |
|   307 |    15355 | ido-hacks                       |
|   310 |    17921 | highlight-symbol                |
|   311 |    29347 | jbeans-theme                    |
|   312 |    14321 | tracking                        |
|   314 |    19525 | yaxception                      |
|   319 |    16520 | anaphora                        |
|   322 |    16051 | avy-migemo                      |
|   322 |    24661 | sr-speedbar                     |
|   324 |    16238 | fancy-narrow                    |
|   326 |    18431 | splitter                        |
|   327 |    15914 | annotate                        |
|   329 |    20242 | google-this                     |
|   330 |    16467 | discover                        |
|   336 |    18789 | pcomplete-extension             |
|   337 |    26820 | moe-theme                       |
|   349 |    17950 | helm-ls-git                     |
|   349 |    22516 | outline-magic                   |
|   352 |    16136 | keyfreq                         |
|   359 |    21168 | visual-regexp-steroids          |
|   363 |    25713 | guide-key                       |
|   364 |    30981 | plan9-theme                     |
|   365 |    17298 | state                           |
|   365 |    24961 | demo-it                         |
|   371 |    17223 | use-package                     |
|   373 |    39987 | lacarte                         |
|   374 |    20405 | symon                           |
|   375 |    20934 | helm-cmd-t                      |
|   381 |    17856 | smex                            |
|   384 |    17941 | esup                            |
|   384 |    34405 | darktooth-theme                 |
|   388 |    18168 | commander                       |
|   388 |    19726 | sunshine                        |
|   390 |    18050 | concurrent                      |
|   390 |    18265 | helm-ag                         |
|   391 |    19301 | mag-menu                        |
|   391 |    24019 | smooth-scroll                   |
|   391 |    27850 | basic-theme                     |
|   396 |    17523 | seq                             |
|   398 |    19493 | link-hint                       |
|   399 |    21189 | lisp-extra-font-lock            |
|   402 |    17483 | ace-window                      |
|   402 |    18427 | diredful                        |
|   402 |    19660 | quelpa                          |
|   405 |    16830 | metaweblog                      |
|   413 |    19009 | yari                            |
|   414 |    19701 | image+                          |
|   416 |    16406 | f                               |
|   418 |    58159 | soothe-theme                    |
|   422 |    22006 | html-to-markdown                |
|   424 |    26483 | jg-quicknav                     |
|   426 |    17122 | electric-operator               |
|   431 |    24827 | el-init                         |
|   433 |    21679 | key-combo                       |
|   433 |    22260 | eval-sexp-fu                    |
|   435 |    26121 | on-screen                       |
|   437 |    19882 | powerline                       |
|   438 |    21683 | eyebrowse                       |
|   439 |    21630 | ag                              |
|   439 |    23710 | jist                            |
|   440 |    24751 | log4e                           |
|   445 |    21228 | polymode                        |
|   446 |    20471 | bbyac                           |
|   446 |    20709 | boxquote                        |
|   447 |    22033 | makey                           |
|   452 |    22373 | linked-buffer                   |
|   456 |    25500 | epl                             |
|   462 |    30209 | flatui-theme                    |
|   464 |    34405 | assess                          |
|   464 |    34794 | sisyphus                        |
|   466 |    22123 | runner                          |
|   482 |    19681 | s                               |
|   488 |    32394 | multi-term                      |
|   492 |    24467 | swoop                           |
|   500 |    27315 | org-journal                     |
|   503 |    32720 | multicolumn                     |
|   505 |    26521 | color-identifiers-mode          |
|   510 |    25306 | git-commit-mode                 |
|   512 |    33678 | afternoon-theme                 |
|   519 |    25729 | keymap-utils                    |
|   519 |    28252 | origami                         |
|   520 |    33229 | log4j-mode                      |
|   525 |    33209 | grandshell-theme                |
|   526 |    34973 | spacegray-theme                 |
|   533 |    37235 | back-button                     |
|   544 |    27639 | inf-ruby                        |
|   552 |    26597 | ov                              |
|   563 |    25977 | org-grep                        |
|   568 |    31299 | with-editor                     |
|   574 |    26460 | gist                            |
|   575 |    27712 | dired-subtree                   |
|   579 |    38533 | ample-zen-theme                 |
|   582 |    23894 | mew                             |
|   582 |    28431 | naquadah-theme                  |
|   590 |    26913 | smartwin                        |
|   596 |    30497 | eww-lnum                        |
|   601 |    25740 | yagist                          |
|   607 |    30052 | gotham-theme                    |
|   612 |    38594 | decl                            |
|   612 |    41128 | button-lock                     |
|   613 |    28190 | full-ack                        |
|   613 |    43094 | hexrgb                          |
|   614 |    29154 | poporg                          |
|   615 |    35086 | revive                          |
|   616 |    30754 | cycbuf                          |
|   621 |    42107 | cyberpunk-theme                 |
|   628 |    30273 | org-gcal                        |
|   630 |    26062 | swiper                          |
|   635 |    28413 | id-manager                      |
|   637 |    33617 | m-buffer                        |
|   647 |    37592 | xml-rpc                         |
|   652 |    36187 | litable                         |
|   654 |    29280 | ox-reveal                       |
|   655 |    25214 | subatomic-theme                 |
|   659 |    34918 | window-layout                   |
|   665 |    47691 | ample-theme                     |
|   669 |    30540 | anzu                            |
|   670 |    29509 | migemo                          |
|   671 |    35249 | pos-tip                         |
|   672 |    39611 | color-theme-sanityinc-solarized |
|   674 |    29989 | orgtbl-aggregate                |
|   674 |    36598 | helm-projectile                 |
|   677 |    32450 | perspective                     |
|   680 |    34810 | minesweeper                     |
|   683 |    36889 | escreen                         |
|   684 |    44482 | wiki-nav                        |
|   685 |    29385 | shelldoc                        |
|   685 |    31325 | bog                             |
|   695 |    46948 | material-theme                  |
|   711 |    43863 | hardhat                         |
|   716 |    40309 | color-theme-sanityinc-tomorrow  |
|   718 |    39570 | ido-ubiquitous                  |
|   720 |    33122 | easy-kill                       |
|   720 |    33657 | ack-menu                        |
|   721 |    45934 | el-get                          |
|   723 |    34277 | cask                            |
|   723 |    41469 | anything-complete               |
|   725 |    33821 | anything-project                |
|   731 |    45249 | macrostep                       |
|   736 |    42638 | dtrt-indent                     |
|   738 |    33040 | git-gutter                      |
|   740 |    51606 | leuven-theme                    |
|   744 |    38380 | list-utils                      |
|   747 |    35388 | hl-anything                     |
|   749 |    41290 | alert                           |
|   769 |    35482 | deferred                        |
|   779 |    58643 | auto-install                    |
|   780 |    47303 | ignoramus                       |
|   782 |    51933 | flatland-theme                  |
|   789 |    33542 | direx                           |
|   793 |    36052 | fcopy                           |
|   803 |    38576 | worf                            |
|   808 |    43093 | ace-jump-mode                   |
|   817 |    44855 | visual-regexp                   |
|   826 |    35481 | wgrep                           |
|   834 |    52337 | lentic                          |
|   845 |    37871 | hydra                           |
|   861 |    42732 | lusty-explorer                  |
|   872 |    35792 | neotree                         |
|   873 |    39124 | yabin                           |
|   885 |    58100 | aurora-theme                    |
|   888 |    62118 | hc-zenburn-theme                |
|   892 |    46232 | websocket                       |
|   892 |    46368 | zencoding-mode                  |
|   900 |    50568 | dired-filter                    |
|   907 |    43787 | popwin                          |
|   925 |    51625 | emojify                         |
|   945 |    44606 | ox-pandoc                       |
|   962 |    46719 | org2blog                        |
|   962 |    59249 | anti-zenburn-theme              |
|   967 |    63350 | win-switch                      |
|   976 |    41085 | avy                             |
|   978 |    44203 | enh-ruby-mode                   |
|   996 |    47836 | browse-kill-ring                |
|   998 |    69667 | darkburn-theme                  |
|  1010 |    51733 | bm                              |
|  1017 |    49134 | helm-gtags                      |
|  1040 |    49512 | rust-mode                       |
|  1041 |    71206 | zenburn-theme                   |
|  1045 |    52312 | request                         |
|  1077 |    57148 | paxedit                         |
|  1102 |    49916 | names                           |
|  1107 |    44565 | prodigy                         |
|  1110 |    63929 | pophint                         |
|  1125 |    53368 | auto-highlight-symbol           |
|  1153 |    60290 | which-key                       |
|  1172 |    55381 | quickrun                        |
|  1174 |    55117 | omnisharp                       |
|  1203 |    77311 | smart-mode-line                 |
|  1208 |    56302 | php-mode                        |
|  1217 |    72410 | simple-call-tree+               |
|  1218 |    61343 | persp-mode                      |
|  1232 |    55213 | popup                           |
|  1259 |    56487 | summarye                        |
|  1263 |    59742 | weblogger                       |
|  1266 |    59229 | go-mode                         |
|  1286 |    67877 | color-theme                     |
|  1299 |    68575 | package-build                   |
|  1321 |    65668 | helm-swoop                      |
|  1329 |    78074 | yaoddmuse                       |
|  1352 |    74816 | pandoc-mode                     |
|  1355 |    58673 | ruby-mode                       |
|  1370 |    63511 | elscreen                        |
|  1403 |    99859 | isearch-prop                    |
|  1447 |   101625 | palette                         |
|  1487 |    68980 | outorg                          |
|  1517 |    73728 | tabbar                          |
|  1529 |    97029 | windows                         |
|  1552 |    76415 | lua-mode                        |
|  1605 |    73503 | ctable                          |
|  1622 |   140690 | highlight                       |
|  1738 |   105641 | alect-themes                    |
|  1775 |    79298 | workgroups                      |
|  1812 |    74661 | auto-complete                   |
|  1837 |    78758 | counsel                         |
|  1855 |    87318 | mediawiki                       |
|  1864 |    98746 | navi-mode                       |
|  2046 |    84739 | dash                            |
|  2070 |   114254 | font-lock-studio                |
|  2102 |   119281 | pcre2el                         |
|  2206 |   108569 | projectile                      |
|  2242 |   105312 | company                         |
|  2242 |   115266 | org-toodledo                    |
|  2275 |   111957 | rebox2                          |
|  2430 |   131710 | gnuplot                         |
|  2492 |   121698 | paredit                         |
|  2714 |   128944 | org-drill                       |
|  2782 |   113501 | ivy                             |
|  2791 |   160928 | outshine                        |
|  2871 |   169639 | csharp-mode                     |
|  2988 |   136032 | circe                           |
|  2998 |   118721 | yatex                           |
|  3080 |   171320 | undo-tree                       |
|  3177 |   179932 | anything                        |
|  3343 |   133789 | imakado                         |
|  3504 |   139280 | emmet-mode                      |
|  3733 |   188891 | yasnippet                       |
|  3966 |   164902 | japanlaw                        |
|  4287 |   365774 | ucs-utils                       |
|  4444 |   198364 | monokai-theme                   |
|  4910 |   236912 | helm                            |
|  5103 |   205259 | skk                             |
|  5232 |   289703 | markdown-mode                   |
|  6104 |   286725 | slime                           |
|  6125 |   289642 | flycheck                        |
|  6908 |   329671 | smartparens                     |
|  9428 |   431968 | bongo                           |
| 10450 |   422668 | web-mode                        |
| 10519 |   421135 | w3m                             |
| 11004 |   501553 | js2-mode                        |
| 11426 |   466886 | twittering-mode                 |


# (progn (forward-line 1)(shell-command "screenshot-time.rb org_template" t))
